PaulStoffregen/SD/utility/KinetisSDHC.c
// adapted for Arduino SD library by Paul Stoffregen
// following code is modified by Walter Zimmer from
// from version provided by
// Petr Gargulak (NXP Employee)
//https://community.nxp.com/servlet/JiveServlet/download/339474-1-263510/SDHC_K60_Baremetal.ZIP
//see also
//https://community.nxp.com/thread/99202

#if defined(__MK64FX512__) || defined(__MK66FX1M0__)

#include "kinetis.h"
//#include "core_pins.h" // testing only
//#include "HardwareSerial.h" // testing only

// Missing in Teensyduino 1.30
#ifndef MPU_CESR_VLD_MASK
#define MPU_CESR_VLD_MASK         0x1u
#endif

/******************************************************************************
* Constants
******************************************************************************/

enum {
        SDHC_RESULT_OK = 0,             /* 0: Successful */
        SDHC_RESULT_ERROR,              /* 1: R/W Error */
        SDHC_RESULT_WRPRT,              /* 2: Write Protected */
        SDHC_RESULT_NOT_READY,          /* 3: Not Ready */
        SDHC_RESULT_PARERR,             /* 4: Invalid Parameter */
        SDHC_RESULT_NO_RESPONSE         /* 5: No Response */ // from old diskio.h
};

/*void print_result(int n)
{
        switch (n) {
        case SDHC_RESULT_OK: serial_print("OK\n"); break;
        case SDHC_RESULT_ERROR: serial_print("R/W Error\n"); break;
        case SDHC_RESULT_WRPRT: serial_print("Write Protect\n"); break;
        case SDHC_RESULT_NOT_READY: serial_print("Not Ready\n"); break;
        case SDHC_RESULT_PARERR: serial_print("Invalid Param\n"); break;
        case SDHC_RESULT_NO_RESPONSE: serial_print("No Response\n"); break;
        default: serial_print("Unknown result\n");
        }
}*/

#define SDHC_STATUS_NOINIT              0x01    /* Drive not initialized */
#define SDHC_STATUS_NODISK              0x02    /* No medium in the drive */
#define SDHC_STATUS_PROTECT             0x04    /* Write protected */


#define IO_SDHC_ATTRIBS (IO_DEV_ATTR_READ | IO_DEV_ATTR_REMOVE | IO_DEV_ATTR_SEEK | IO_DEV_ATTR_WRITE | IO_DEV_ATTR_BLOCK_MODE)

#define SDHC_XFERTYP_RSPTYP_NO              (0x00)
#define SDHC_XFERTYP_RSPTYP_136             (0x01)
#define SDHC_XFERTYP_RSPTYP_48              (0x02)
#define SDHC_XFERTYP_RSPTYP_48BUSY          (0x03)

#define SDHC_XFERTYP_CMDTYP_ABORT           (0x03)

#define SDHC_PROCTL_EMODE_INVARIANT         (0x02)

#define SDHC_PROCTL_DTW_1BIT                (0x00)
#define SDHC_PROCTL_DTW_4BIT                (0x01)
#define SDHC_PROCTL_DTW_8BIT                (0x10)

#define SDHC_INITIALIZATION_MAX_CNT 100000

/* SDHC commands */
#define SDHC_CMD0                           (0)
#define SDHC_CMD1                           (1)
#define SDHC_CMD2                           (2)
#define SDHC_CMD3                           (3)
#define SDHC_CMD4                           (4)
#define SDHC_CMD5                           (5)
#define SDHC_CMD6                           (6)
#define SDHC_CMD7                           (7)
#define SDHC_CMD8                           (8)
#define SDHC_CMD9                           (9)
#define SDHC_CMD10                          (10)
#define SDHC_CMD11                          (11)
#define SDHC_CMD12                          (12)
#define SDHC_CMD13                          (13)
#define SDHC_CMD15                          (15)
#define SDHC_CMD16                          (16)
#define SDHC_CMD17                          (17)
#define SDHC_CMD18                          (18)
#define SDHC_CMD20                          (20)
#define SDHC_CMD24                          (24)
#define SDHC_CMD25                          (25)
#define SDHC_CMD26                          (26)
#define SDHC_CMD27                          (27)
#define SDHC_CMD28                          (28)
#define SDHC_CMD29                          (29)
#define SDHC_CMD30                          (30)
#define SDHC_CMD32                          (32)
#define SDHC_CMD33                          (33)
#define SDHC_CMD34                          (34)
#define SDHC_CMD35                          (35)
#define SDHC_CMD36                          (36)
#define SDHC_CMD37                          (37)
#define SDHC_CMD38                          (38)
#define SDHC_CMD39                          (39)
#define SDHC_CMD40                          (40)
#define SDHC_CMD42                          (42)
#define SDHC_CMD52                          (52)
#define SDHC_CMD53                          (53)
#define SDHC_CMD55                          (55)
#define SDHC_CMD56                          (56)
#define SDHC_CMD60                          (60)
#define SDHC_CMD61                          (61)
#define SDHC_ACMD6                          (0x40 + 6)
#define SDHC_ACMD13                         (0x40 + 13)
#define SDHC_ACMD22                         (0x40 + 22)
#define SDHC_ACMD23                         (0x40 + 23)
#define SDHC_ACMD41                         (0x40 + 41)
#define SDHC_ACMD42                         (0x40 + 42)
#define SDHC_ACMD51                         (0x40 + 51)

#define SDHC_FIFO_BUFFER_SIZE               16
#define SDHC_BLOCK_SIZE                     512

/******************************************************************************
* Macros 
******************************************************************************/

// prescale can be 2, 4, 8, 16, 32, 64, 128, 256
// divisor can be 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16
#define SDHC_SYSCTL_DIVISOR(prescale, divisor) \
	(SDHC_SYSCTL_SDCLKFS((prescale)>>1)|SDHC_SYSCTL_DVS((divisor)-1))

#if (F_CPU == 240000000)
  #define SDHC_SYSCTL_400KHZ  SDHC_SYSCTL_DIVISOR(64, 10) // 375 kHz
  #define SDHC_SYSCTL_25MHZ   SDHC_SYSCTL_DIVISOR(2, 5)   // 24 MHz
  #define SDHC_SYSCTL_50MHZ   SDHC_SYSCTL_DIVISOR(2, 3)   // 40 MHz
#elif (F_CPU == 216000000)
  #define SDHC_SYSCTL_400KHZ  SDHC_SYSCTL_DIVISOR(64, 9)  // 375 kHz
  #define SDHC_SYSCTL_25MHZ   SDHC_SYSCTL_DIVISOR(2, 5)   // 21.6 MHz
  #define SDHC_SYSCTL_50MHZ   SDHC_SYSCTL_DIVISOR(2, 3)   // 36 MHz
#elif (F_CPU == 192000000)
  #define SDHC_SYSCTL_400KHZ  SDHC_SYSCTL_DIVISOR(32, 15) // 400 kHz
  #define SDHC_SYSCTL_25MHZ   SDHC_SYSCTL_DIVISOR(2, 4)   // 24 MHz
  #define SDHC_SYSCTL_50MHZ   SDHC_SYSCTL_DIVISOR(2, 2)   // 48 MHz
#elif (F_CPU == 180000000)
  #define SDHC_SYSCTL_400KHZ  SDHC_SYSCTL_DIVISOR(32, 15) // 351 kHz
  #define SDHC_SYSCTL_25MHZ   SDHC_SYSCTL_DIVISOR(2, 4)   // 22.5 MHz
  #define SDHC_SYSCTL_50MHZ   SDHC_SYSCTL_DIVISOR(2, 2)   // 45 MHz
#elif (F_CPU == 168000000)
  #define SDHC_SYSCTL_400KHZ  SDHC_SYSCTL_DIVISOR(32, 14) // 375 kHz
  #define SDHC_SYSCTL_25MHZ   SDHC_SYSCTL_DIVISOR(2, 4)   // 21 MHz
  #define SDHC_SYSCTL_50MHZ   SDHC_SYSCTL_DIVISOR(2, 2)   // 42 MHz
#elif (F_CPU == 144000000)
  #define SDHC_SYSCTL_400KHZ  SDHC_SYSCTL_DIVISOR(32, 12) // 375 kHz
  #define SDHC_SYSCTL_25MHZ   SDHC_SYSCTL_DIVISOR(2, 3)   // 24 MHz
  #define SDHC_SYSCTL_50MHZ   SDHC_SYSCTL_DIVISOR(2, 2)   // 36 MHz
#elif (F_CPU == 120000000)
  #define SDHC_SYSCTL_400KHZ  SDHC_SYSCTL_DIVISOR(32, 10) // 375 kHz
  #define SDHC_SYSCTL_25MHZ   SDHC_SYSCTL_DIVISOR(2, 3)   // 20 MHz
  #define SDHC_SYSCTL_50MHZ   SDHC_SYSCTL_DIVISOR(2, 2)   // 30 MHz
#elif (F_CPU == 96000000)
  #define SDHC_SYSCTL_400KHZ  SDHC_SYSCTL_DIVISOR(16, 15) // 400 kHz
  #define SDHC_SYSCTL_25MHZ   SDHC_SYSCTL_DIVISOR(2, 2)   // 24 MHz
  #define SDHC_SYSCTL_50MHZ   SDHC_SYSCTL_DIVISOR(2, 1)   // 48 MHz
#elif (F_CPU == 72000000)
  #define SDHC_SYSCTL_400KHZ  SDHC_SYSCTL_DIVISOR(16, 12) // 375 kHz
  #define SDHC_SYSCTL_25MHZ   SDHC_SYSCTL_DIVISOR(2, 2)   // 18 MHz
  #define SDHC_SYSCTL_50MHZ   SDHC_SYSCTL_DIVISOR(2, 1)   // 36 MHz
#elif (F_CPU == 48000000)
  #define SDHC_SYSCTL_400KHZ  SDHC_SYSCTL_DIVISOR(8, 15)  // 400 kHz
  #define SDHC_SYSCTL_25MHZ   SDHC_SYSCTL_DIVISOR(2, 1)   // 24 MHz
  #define SDHC_SYSCTL_50MHZ   SDHC_SYSCTL_DIVISOR(2, 1)   // 24 MHz
#elif (F_CPU == 24000000)
  #define SDHC_SYSCTL_400KHZ  SDHC_SYSCTL_DIVISOR(4, 15)  // 500 kHz
  #define SDHC_SYSCTL_25MHZ   SDHC_SYSCTL_DIVISOR(2, 1)   // 12 MHz
  #define SDHC_SYSCTL_50MHZ   SDHC_SYSCTL_DIVISOR(2, 1)   // 12 MHz
#elif (F_CPU == 16000000)
  #define SDHC_SYSCTL_400KHZ  SDHC_SYSCTL_DIVISOR(4, 10)  // 400 kHz
  #define SDHC_SYSCTL_25MHZ   SDHC_SYSCTL_DIVISOR(2, 1)   // 8 MHz
  #define SDHC_SYSCTL_50MHZ   SDHC_SYSCTL_DIVISOR(2, 1)   // 8 MHz
#elif (F_CPU == 8000000)
  #define SDHC_SYSCTL_400KHZ  SDHC_SYSCTL_DIVISOR(2, 10)  // 400 kHz
  #define SDHC_SYSCTL_25MHZ   SDHC_SYSCTL_DIVISOR(2, 1)   // 4 MHz
  #define SDHC_SYSCTL_50MHZ   SDHC_SYSCTL_DIVISOR(2, 1)   // 4 MHz
#elif (F_CPU == 4000000)
  #define SDHC_SYSCTL_400KHZ  SDHC_SYSCTL_DIVISOR(2, 5)   // 400 kHz
  #define SDHC_SYSCTL_25MHZ   SDHC_SYSCTL_DIVISOR(2, 1)   // 2 MHz
  #define SDHC_SYSCTL_50MHZ   SDHC_SYSCTL_DIVISOR(2, 1)   // 2 MHz
#elif (F_CPU == 2000000)
  #define SDHC_SYSCTL_400KHZ  SDHC_SYSCTL_DIVISOR(2, 3)   // 333 kHz
  #define SDHC_SYSCTL_25MHZ   SDHC_SYSCTL_DIVISOR(2, 1)   // 1 MHz
  #define SDHC_SYSCTL_50MHZ   SDHC_SYSCTL_DIVISOR(2, 1)   // 1 MHz
#endif


